global.Talk = [
    '焚烧是一种快感',
    '看着东西被吞噬，烧焦，变样',
    '纤弱得就像花瓣似的',
    '点燃第一页',
    '点燃第二页',
    '每一页都变成一只黑蝴蝶',
    '从第二页再点燃第三页',
    '一页一页',
    '一章一章',
    '把那些字句的所有无聊的意涵',
    '所有虚假的希望',
    '所有二手观念和老掉牙的哲学',
    '烧成一连串的灰烟',
    '所以啊',
    '再来跳一支舞吧',
    '悠悠荡荡',
    '有如一片片落下',
    '惜别之语',
    '仿如再见花开',
    '又如夏叶间悠悠落尽的阳光',
    '雨过冷冷清清',
    '偶见一花开',
    '趁着风儿吹',
    '再朝前走一段吧',
    '野草轻摇曳',
    '也不知盼着谁来',
    '每一忘却',
    '心上就添一空白',
    '怎教人不伤心呢',
    '那又如...那又如',
    '事已至此,随风而舞吧',
    '啊,我们不是从来都一心同体吗?',
    '你泪拭去,便如雨落',
    '又如夏叶间的阳光飘飘洒洒',
    '纷纷落尽一般',
    '趁着雨未停',
    '再朝前走一段吧',
    '背影渐离去',
    '伴时雨忽现忽隐',
    '忘却是件痛苦事',
    '也是件合乎于理的寻常事吧',
    '任凭言语 闲无事 空消遣',
    '纷纷扬扬,有如夕阳落红',
    '五月淫雨 来又去 似花焰',
    '一经离去,天便骤然放晴',
    '等待着你,等待着似火一般',
    '燃烧的云,仿若血见愁',
    '又如风儿的云中祭典般',
    '刀枪剑戟 摆的齐',
    '五色旌旗 空中起',
    '人马纷飞 绕树低',
    '火烧连营烟尘急',
    '见几个 手执钢鞭',
    '叫我怒从心头起',
    '见几个 道诡异仙',
    '怎可受你恶神欺',
    '莫不是你得寸进尺',
    '好叫我来把兵提',
    '莫不是你胆大妄为',
    '好叫我把红袍披',
    '一团火追的尔等',
    '上天入地东躲西藏',
    '定叫你成了败寇我为王',
    '我看见了美丽的蝴蝶',
    '却不知它的姓名',
    '仿佛饮尽了沙漠中的沙丘',
    '也品尝不出其中的干涸',
    '跟在我身后的那美丽蝴蝶啊',
    '就以这样缓慢的速度 一点点地飞过了我',
    '缓缓 慢慢地 轻盈得像是一个哈欠',
    '飞来 又转去 朝来暮回般地回到身旁',
    '我看见了美丽的蝴蝶',
    '飞过这丑陋的自己',
    '将这片汪洋大海饮尽的我',
    '不知道怎样才能得到满足',
    '翅膀上美丽的鳞粉啊',
    '将地平线染上色彩',
    '以我不可能赶上的速度 掠过我的身旁',
    '轻轻 悠悠地 在树叶洒下的阳光间',
    '飞来 又转去 朝来暮回般地回到身旁',
    '我行走过的街道',
    '我的双脚',
    '我抚摸过的花朵',
    '我的手指',
    '我死去那天的早上',
    '或是别的那些日子',
    '在我身后的一切 都渐渐将我超过飞向远方',
    '缓缓 慢慢地 轻盈得像是一个哈欠',
    '飞来 又转去 朝来暮回般地掠过身旁',
    '缓缓 慢慢地 你飞向那遥远彼方',
    '一边小心翼翼地张开翅膀',
    // 添加的段落开始
    '你蹬踏脚下的月亮， 纷飞的白沙犹如一盏夜灯， 你大概已经意识到了吧？',
    '海浪的尽头一定有什么我不知道的东西存在着， 不禁有些寂寞。',
    '洒落吧 再洒落些 沐我以月光， 直至洒满每寸肌肤 仅是如此， 就已泛滥。',
    '在月上柴米油盐的日子， 谁曾和我诉说它的日月， 于月间空度光阴的我们， 说来就像月光浴一样呢。',
    '等待海浪轻拍 翻越日月， 浸浴我身 如同一盏夜灯， 将月泛白。',
    '洒落吧 再洒落些 沐我以遗忘， 直至遍布每寸回忆 仅是如此， 便已永浴日月之上。',
    '给我这颗心， 却留你以这束花，',
    '唯有风中飞扬的头发 随风依旧，',
    '我们的家如同盒中的小屋，',
    '两人并肩在这狭小的厨房，',
    '飘荡在细长窗帘外的是你我回忆的庭园，',
    '在这儿覆上一片春日的阳光，',
    '时不时浇灌一些水的滋养，',
    '等到这棵小树长出枇杷的时候 就把我忘了吧，',
    '为我留下这颗心吧，',
    '为你献上这束花，',
    '只余风中飞扬的头发 随风依旧，',
    '再对我说一些话吧，',
    '连同你轻柔的哼唱，',
    '都留在今后这漫漫长路的前方，',
    '一个一个地数数看吧，',
    '在除我以外你自己的人生中，',
    '是否有你能喜欢上的东西呢？',
    '……一个都没有吗？',
    '从海边那个不起眼的车站，',
    '步行五分钟到达的海岸，',
    '我们曾一起望见的那片翡翠，',
    '现在也请你忘记吧，',
    '就当是为我，',
    '为我，',
    '忘记吧，',
    '请为我，',
    '为我，',
    '为我，',
    '就为我留下这颗心吧，',
    '为你自己献上这束花，',
    '唯有风中飞扬的头发 随风依旧，',
    '将你想告诉我的话，',
    '将你那轻声的哼唱，',
    '都留到今后这漫漫长路的前方。',
    // 添加的段落结束
    '啊！心情有点愉快！',
    '宛如花儿在脚边盛开',
    '啊！稍微有点难过！',
    '宛如鱼忘了水的存在',
    '切合着自由伸缩的节拍',
    '我的心跳就像进行曲一般',
    '虽然这并不流行的旋律已经有点脱离时代',
    '我已经准备忘记了哦',
    '是否还爱着那悲伤的歌呢？',
    '听得已经厌倦',
    '却还一直回转的那张唱片',
    '我一直在寻找',
    '做多少遍都不会厌倦的事啊',
    '像和太阳公公开始新一天的演奏般',
    '好开心',
    '啊，忽然有点悲伤',
    '好比野犬抬头望见了月亮',
    '圆得好像吃惊地张大嘴',
    '就不能让我咬一口下来吗？',
    '所有人都在笑着啊……这首歌有这么受人欢迎吗？',
    '才不是！',
    '大家是在嘲笑你落伍的歌品啊！',
    '我已经快要忘记了哦',
    '是否也爱着这快乐的歌呢？',
    '就把这张唱片',
    '当作我们所忘之事的遗像吧',
    '这场没有终点的旅程还在继续哦',
    '像和神明大人欢快演奏的乐章般',
    '好开心'
];

// Talk=_.filter(Talk,e=>e.length==20);
/**
 * 主循环里面里面调用 一次 TalkAll()
 */
let roomMap={};
let creepMap={};

let randomTalk=function (creep,array) {
    if(!roomMap[creep.room.name])
        roomMap[creep.room.name]=Math.floor(array.length*Math.random());
    roomMap[creep.room.name]=(1+roomMap[creep.room.name])%Talk.length;
    let index=roomMap[creep.room.name];
    return {
        i:index,//index
        p:0,//page
        l:array[index].length/10//length
    }
};

Creep.prototype.randomSay=function(float){
    if(creepMap[this.name]){
        creepMap[this.name].p+=1;
        if (creepMap[this.name].p >= creepMap[this.name].l) {
            delete creepMap[this.name]
        }else{
            this.say(Talk[creepMap[this.name].i].substr(creepMap[this.name].p*10),true)
        }
    }else if(float>Math.random()){
        let $talk = randomTalk(this,Talk);
        if($talk.l>1)creepMap[this.name]= $talk;
        this.say(Talk[$talk.i],true)
    }
};

global.TalkAll=function () {
    _.values(Game.creeps).forEach(e=>e.randomSay(0.15));
    if(Game.time%3253==0){//质数
        _.keys(creepMap).forEach(name=>{
            if (!Game.creeps[name]) {
                delete creepMap[name];
            }
        });
    }
};