// nameData.js

/**
 * 名字数据(包括可以说的话)
 * 这里每个蛊虫名对应一个空对象，后续可以为其添加更多的属性
 */
export const nameData = {
    "力量蛊": {},
    "智慧蛊": {},
    "希望蛊": {},
    "规蛊": {},
    "矩蛊": {},
    "寿蛊": {},
    "态度蛊": {},
    "名声蛊": {},
    "自己蛊": {},
    "神游蛊": {},
    "虚荣蛊": {},
    "爱情蛊": {},
    "永生蛊": {},
    "定仙游": {},
    "思想蛊": {},
    "勇气蛊": {},
    "胆识蛊": {},
    "失败蛊": {},
    "背叛蛊": {},
    "火蛊": {},
    "生命蛊": {},
    "努力蛊": {},
    "书虫": {},
    "谦虚蛊": {},
    "实践蛊": {},
    "骄傲蛊": {},
    "学习蛊": {},
    "能力蛊": {},
    "公平蛊": {},
    "财富蛊": {},
    "强蛊": {},
    "弱蛊": {},
    "宿命蛊": {},
    "仇恨蛊": {},
    "自由蛊": {},
    "衍化蛊": {},
    "坚持蛊": {},
    "年蛊": {},
    "月蛊": {},
    "日蛊": {}
};
